INSERT INTO main.genres (genre_name,description) VALUES
	 ('Рок','Рок-музыка (англ. Rock music) — обобщающее название ряда направлений популярной музыки. Слово rock (в переводе с английского «качать», «укачивать», «качаться») в данном случае указывает на характерные для этих направлений ритмические ощущения, связанные с определённой формой движения, по аналогии с roll, twist, swing, shake… Такие признаки рок-музыки, как использование электромузыкальных инструментов, творческая самодостаточность (для рок-музыкантов характерно исполнение композиций собственного сочинения), являются вторичными и часто вводят в заблуждение. Истоки рок-музыки лежат в блюзе, из которого и вышли первые рок-жанры — рок-н-ролл и рокабилли, однако непосредственным предшественником рок-музыки был ритм-н-блюз.'),
	 ('Шансон','Шансо́н (фр. chanson — песня) — французская эстрадная песня в стиле кабаре.'),
	 ('Джаз','Джаз (англ. jazz) — форма музыкального искусства, возникшая в конце XIX — начале XX века в США в результате синтеза африканской и европейской культур и получившая впоследствии повсеместное распространение. Характерными чертами музыкального языка джаза изначально стали импровизация, полиритмия, основанная на синкопированных ритмах, и уникальный комплекс приёмов исполнения ритмической фактуры — свинг. Дальнейшее развитие джаза происходило за счёт освоения джазовыми музыкантами и композиторами новых ритмических и гармонических моделей.'),
	 ('Блюз','Блюз (англ. blues от blue devils) — музыкальная форма и музыкальный жанр, зародившиеся в конце XIX века в афроамериканском сообществе Юго-востока США, в среде выходцев с плантаций «Хлопкового пояса». Является (наряду с рэгтаймом, ранним джазом, рэпом и др.) одним из наиболее влиятельных вкладов афроамериканцев в мировую музыкальную культуру, сложившимся из таких её проявлений, как «рабочая песня»[en], холер[en] (ритмичные вскрики, сопровождавшие работу в поле), выкрики в ритуалах африканских религиозных культов (англ. ринг-шаут[en]), спиричуэлс (христианские песнопения в особой манере), шант[en] и баллады (короткие стихотворные истории). Блюз во многом повлиял на современную популярную музыку, в особенности таких жанров как «поп», «джаз», «рок-н-ролл» «соул».'),
	 ('Поп-музыка','Поп-му́зыка (англ. pop music от popular music; современная популярная музыка[1], жарг. попса) — область массовой культуры, охватывающая различные формы, жанры и стили развлекательной и прикладной музыки 2-й половины XX — начала XXI веков[2]. Вид массовой культуры.'),
	 ('Рэп','Рэп (англ. rap, rapping) — это ритмичный текст или стихи, которые читают под музыку, обычно с тяжёлым битом. Человек, читающий рэп – это рэпер, или MC. Рэп считается одной из важнейших составляющих хип-хопа; многие люди считают понятия «рэп» и «хип-хоп» синонимами.'),
	 ('Рейв','Ре́йв (англ. rave) — организованная танцевальная вечеринка с привлечением диджеев, обеспечивающих бесшовное воспроизведение электронной танцевальной музыки. Местами проведения рейв-вечеринок могут служить ночные клубы, фестивали на открытом воздухе или иные публичные пространства. Помимо специально предназначенных для этого мест, они также могут проводиться на пустынных территориях, вмещающих большое количество участников, например на территории бывших заводов, ангаров, складов и других промышленных объектов.'),
	 ('Хип-хоп','');
	
	 
INSERT INTO main.albums (album_name,description,release_year,picture) VALUES
	 ('Гуляй, мужик!','«Гуляй, мужик!» — пятый официальный альбом российской рок-группы «Сектор Газа», записанный зимой 1992 года.',1992,NULL),
	 ('Наркологический университет миллионов','Наркологи́ческий университе́т миллио́нов — одиннадцатый студийный альбом группы «Сектор Газа», выпущенный в мае 1997 года.',1997,NULL),
	 ('Полный вперёд','«Полный вперёд!» — одиннадцатый студийный альбом Григория Лепса. Премьера альбома состоялась на юбилейных концертах певца 4, 5, 7 и 8 декабря 2012 года в концертном зале «Crocus City Hall».',2012,NULL),
	 ('Лабиринт','«Лабиринт» — шестой студийный альбом Григория Лепса, вышедший в свет в мае 2006 года. К песням «Лабиринт», «Вьюга» и «Она» были сняты видеоклипы. В интернете также есть неофициальный клип на песню «Рок-н-ролл».',2006,NULL),
	 ('Владимирский централ','Владимирский централ — одна из самых известных лирических песен автора и исполнителя Михаила Круга в стиле «русский шансон». Впервые вышла в альбоме «Мадам» в 1998 году.',2020,NULL),
	 ('Жиган-лимон','«Жиган-лимон» — первый официальный студийный альбом российского автора и исполнителя песен в жанре «русский шансон» Михаила Круга.',1994,NULL),
	 ('Водопад','Водопад — девятый студийный альбом Григория Лепса, вышедший в свет в 2009 году. Переиздан в апреле 2010 года с включением песен «Новый год» и «Песня Императора»',2009,NULL),
	 ('200 по встречной','«200 по встречной» — дебютный альбом группы «Тату» (t.A.T.u.), выпущенный в 2001 году. Продажи альбома в России составили более 1 миллиона копий[1]. Общий объём продаж англоязычной версии альбома, по данным главы российского отделения Universal, составил более 7 млн экземпляров по всему миру. В 2002 году группа получила премию Международной федерации производителей фонограмм IFPI Platinum Europe Award за миллион проданных в Европе копий альбома.',2002,NULL),
	 ('Gangsta’s Paradise','1995 Gangsta’s Paradise',2019,NULL),
	 ('Зимняя Сказка','К Новому Году Игорь Бутман подготовил потрясающий подарок всем джазовым фанатам - альбом "Зимняя сказка" (Butman Music Records)! Альбом записан Московским джазовым оркестром под управлением маэстро при участии лучших молодых вокалистов - Олега Аккуратова, Виктории Кауновой и Ярославы Симоновой.',2016,NULL),
	 ('Химера','«Химе́ра» — восьмой студийный альбом группы «Ария», вышедший в апреле 2001 года. Последний альбом с вокалистом Валерием Кипеловым. Альбом выдержан в более мелодичном ключе, чем предыдущие, и содержит ряд лирических баллад.',2001,NULL),
	 ('Баста 2','«Баста 2» — второй студийный сольный альбом российского рэпера Басты, изданный в 2007 году. Альбому с отсутствием видеоклипов и ротаций на радио, по данным выпускающей компании «Монолит», к августу 2007 года за два месяца удалось разойтись тиражом 50 000 экземпляров.',2006,NULL),
	 ('New album','',2021,NULL);
	 
INSERT INTO main.singers (singer_name,nickname,biography) VALUES
	 ('Григорий Лепс','Лепс','Григо́рий Ви́кторович Лепсвери́дзе (груз. გრიგორი ვიქტორის ძე ლეფსვერიძე; род. 16 июля 1962, Сочи, Краснодарский край), более известный как Григо́рий Лепс, — советский и российский певец, музыкант, композитор и продюсер, член Международного союза деятелей эстрадного искусства. Заслуженный артист Республики Ингушетия (2004), заслуженный артист Российской Федерации (2011)[3], народный артист Карачаево-Черкесии (2015)[4]. Обладатель премий «World Music Awards», «Песня года», «Золотой граммофон» и др.'),
	 ('Юрий Клинских','Сектор Газа','Ю́рий Никола́евич Клински́х (27 июля 1964, Воронеж — 4 июля 2000, там же), также известный как Ю́рий Хой, — советский и российский рок-музыкант, певец, автор песен, основатель и бессменный лидер группы «Сектор Газа».'),
	 ('Валерий Кипелов','Ария','Вале́рий Алекса́ндрович Кипе́лов (12 июля 1958, Москва) — советский и российский рок-музыкант, певец, композитор и автор песен, работающий в основном в жанре хеви-метал. Известен как один из основателей и первый вокалист рок-группы «Ария» с 1985 по 2002 год. С 2002 года возглавляет собственную группу «Кипелов». Лауреат премии «RAMP» 2007 года в номинации «Отцы рока».'),
	 ('Михаил Круг','Круг','Михаи́л Влади́мирович Воробьёв (7 апреля 1962, Калинин — 1 июля 2002, Тверь), более известный как Михаи́л Круг, — советский и российский певец, бард, шансонье и поэт. Являлся автором и исполнителем песен в жанре «русский шансон», один из самых популярных представителей данного жанра. Поклонники называли его «королём русского шансона»[1][2]. Автор и исполнитель лирической песни «Владимирский централ», ставшей одним из самых известных образцов русского шансона'),
	 ('Юлия Волкова, Елена Катина','Тату','«Тату́» (стилизованно t.A.T.u.) — российский музыкальный коллектив, состоявший из Юлии Волковой и Елены Катиной. Группа создана в 1999 году продюсером Иваном Шаповаловым совместно с композитором Александром Войтинским. Первоначально группа использовала имидж лесбиянок, но со временем отказалась от него.'),
	 ('Игорь Бутман','Бутман','И́горь Миха́йлович Бу́тман (род. 27 октября 1961, Ленинград, РСФСР, СССР) — советский и российский саксофонист; народный артист РФ (2011), лауреат Государственной премии РФ (2003). Награждён Орденом "За заслуги перед Отечеством" IV степени[2]. Художественный руководитель ГБУК г. Москвы "Московский джазовый оркестр п/у Игоря Бутмана"[3]. Член партии «Единая Россия»[4][5]. Член Высшего совета партии «Единая Россия» и Московского регионального политического совета партии'),
	 ('Василий Вакуленко','Баста','Васи́лий Миха́йлович Вакуле́нко (род. 20 апреля 1980 года, Ростов-на-Дону, РСФСР, СССР) — российский музыкант (исполнитель рэпа и других жанров, битмейкер, композитор), телерадиоведущий, актёр, сценарист, режиссёр и продюсер. С 2007 года — совладелец лейбла «Gazgolder»[6]. С октября 2019 года — владелец футбольного клуба СКА (Ростов-на-Дону)'),
	 ('Леон Айви','Coolio','Артис Леон Айви  мл. (англ. Artis Leon Ivey Jr.), более известный как Ку́лио (англ. Coolio) — американский хип-хоп-музыкант, известный главным образом благодаря альбому Gangsta’s Paradise (1995), который считается классикой гангстерского рэпа середины 1990-х. Имеет дом в Лас-Вегасе.');

INSERT INTO main.singers_albums (singer_id,album_id) VALUES
	 (1,4),
	 (1,7),
	 (4,6),
	 (4,5),
	 (1,3),
	 (2,1),
	 (2,2),
	 (5,8),
	 (8,9),
	 (7,10),
	 (6,11),
	 (3,12);
	 
INSERT INTO main.singers_genres (genre_id,singer_id) VALUES
	 (1,4),
	 (1,1),
	 (2,2),
	 (4,2),
	 (2,3),
	 (8,5),
	 (4,8),
	 (4,7),
	 (5,7),
	 (4,1),
	 (3,6),
	 (8,1);
	 
INSERT INTO main.singles (single_name,description,duration,picture,album_id) VALUES
	 ('Кусок',NULL,495222,NULL,1),
	 ('Новогодняя песня',NULL,364319,NULL,1),
	 ('Песенка',NULL,302600,NULL,1),
	 ('Похмел',NULL,478395,NULL,1),
	 ('Самые лучшие тачки',NULL,324123,NULL,1),
	 ('Свин',NULL,474028,NULL,1),
	 ('Марш наркоманов (Колумбийская народная песня)',NULL,505006,NULL,1),
	 ('Любовь раскумаренная',NULL,358659,NULL,1),
	 ('Хорошо в деревне летом',NULL,481023,NULL,1),
	 ('Пора домой',NULL,429281,NULL,1);
INSERT INTO main.singles (single_name,description,duration,picture,album_id) VALUES
	 ('Звёздная болезнь',NULL,383059,NULL,1),
	 ('Вальпургиева ночь',NULL,428523,NULL,1),
	 ('Гуляй, мужик!',NULL,347103,NULL,2),
	 ('Мастурбация',NULL,385862,NULL,2),
	 ('Видак',NULL,365446,NULL,2),
	 ('Колхозная',NULL,428156,NULL,2),
	 ('Я устал',NULL,360550,NULL,2),
	 ('Л.Т.П.',NULL,326089,NULL,2),
	 ('Б.О.М.Ж.',NULL,437291,NULL,2),
	 ('Трипак',NULL,434438,NULL,2);
INSERT INTO main.singles (single_name,description,duration,picture,album_id) VALUES
	 ('Як на хуторе...',NULL,293545,NULL,2),
	 ('Вурдалак',NULL,308920,NULL,2),
	 ('Моя бабка',NULL,350068,NULL,2),
	 ('Частушки',NULL,467987,NULL,2),
	 ('Небо тебя найдет',NULL,423696,NULL,12),
	 ('Тебе дадут знак!',NULL,565093,NULL,12),
	 ('Вампир',NULL,399950,NULL,12),
	 ('Горящая стрела',NULL,398699,NULL,12),
	 ('Штиль',NULL,257613,NULL,12),
	 ('Путь в никуда',NULL,345469,NULL,12);
INSERT INTO main.singles (single_name,description,duration,picture,album_id) VALUES
	 ('Ворон',NULL,474843,NULL,12),
	 ('Осколок льда',NULL,548744,NULL,12),
	 ('Я не сошел с ума',NULL,366551,NULL,12),
	 ('Лабиринт',NULL,552085,NULL,4),
	 ('Вьюга',NULL,382113,NULL,4),
	 ('Чёрный дождь',NULL,569345,NULL,4),
	 ('Дом',NULL,349959,NULL,4),
	 ('Здесь',NULL,556382,NULL,4),
	 ('Нет, нет, нет',NULL,532990,NULL,4),
	 ('Рок-н-ролл',NULL,271390,NULL,4);
INSERT INTO main.singles (single_name,description,duration,picture,album_id) VALUES
	 ('Разные люди',NULL,596170,NULL,4),
	 ('Она (Она умеет делать любовь)',NULL,542452,NULL,4),
	 ('Люди (Полный вперёд!)',NULL,356057,NULL,3),
	 ('Безопасность',NULL,449794,NULL,3),
	 ('Запой',NULL,460557,NULL,3),
	 ('Он был старше её',NULL,494226,NULL,3),
	 ('Ранняя тишина',NULL,379211,NULL,3),
	 ('Водопадом',NULL,401491,NULL,3),
	 ('Лондон (feat. Тимати)',NULL,422006,NULL,3),
	 ('Я счастливый',NULL,382447,NULL,3);
INSERT INTO main.singles (single_name,description,duration,picture,album_id) VALUES
	 ('Где-то за тучами',NULL,591765,NULL,3),
	 ('Судьба - зима',NULL,511206,NULL,3),
	 ('Се ля ви',NULL,541973,NULL,3),
	 ('Электричка',NULL,285733,NULL,5),
	 ('Девочка-пай',NULL,403793,NULL,5),
	 ('Кольщик',NULL,558515,NULL,5),
	 ('Дороги',NULL,474024,NULL,5),
	 ('Фраер',NULL,433936,NULL,5),
	 ('Добрая, глупая, давняя',NULL,528654,NULL,5),
	 ('Кумовая',NULL,545121,NULL,5);
INSERT INTO main.singles (single_name,description,duration,picture,album_id) VALUES
	 ('Осенний дождь',NULL,494149,NULL,5),
	 ('Не спалила, любила',NULL,301246,NULL,5),
	 ('Катя',NULL,332132,NULL,5),
	 ('Жиган-лимон',NULL,347500,NULL,5),
	 ('А сечку жрите сами',NULL,557175,NULL,5),
	 ('Светочка',NULL,531077,NULL,5),
	 ('День как день (Не верю)',NULL,344708,NULL,5),
	 ('Здравствуйте!',NULL,513054,NULL,6),
	 ('Пусти меня, мама',NULL,319205,NULL,6),
	 ('Водочку пьем',NULL,373867,NULL,6);
INSERT INTO main.singles (single_name,description,duration,picture,album_id) VALUES
	 ('Воробьи',NULL,564911,NULL,6),
	 ('Мадам',NULL,559448,NULL,6),
	 ('Владимирский централ',NULL,530415,NULL,6),
	 ('Девочка-пай 2',NULL,419977,NULL,6),
	 ('Роза',NULL,596270,NULL,6),
	 ('Доброго пути',NULL,290196,NULL,6),
	 ('Не спалила, любила',NULL,478261,NULL,6),
	 ('А сечку жрите сами',NULL,492126,NULL,6),
	 ('Электричка',NULL,470857,NULL,6),
	 ('Дороги',NULL,452612,NULL,6);
INSERT INTO main.singles (single_name,description,duration,picture,album_id) VALUES
	 ('Жиган-лимон',NULL,512722,NULL,6),
	 ('Кумовая',NULL,345355,NULL,6),
	 ('Всё сбудется',NULL,338675,NULL,6),
	 ('Фраер',NULL,271319,NULL,6),
	 ('Водопад',NULL,588903,NULL,7),
	 ('Бессонница',NULL,456163,NULL,7),
	 ('Лодка',NULL,447760,NULL,7),
	 ('Чёрный снегопад',NULL,302568,NULL,7),
	 ('Что может человек?',NULL,472080,NULL,7),
	 ('Беги по небу',NULL,474520,NULL,7);
INSERT INTO main.singles (single_name,description,duration,picture,album_id) VALUES
	 ('Свои',NULL,537107,NULL,7),
	 ('Слова',NULL,263669,NULL,7),
	 ('Берега',NULL,599127,NULL,7),
	 ('Новый год',NULL,349977,NULL,7),
	 ('Ты опоздала',NULL,490446,NULL,7),
	 ('Уходи красиво',NULL,531325,NULL,7),
	 ('Я тебя не люблю',NULL,453543,NULL,7),
	 ('Озеро надежды',NULL,416795,NULL,7),
	 ('Я тебе не верю (feat. Ирина Аллегрова)',NULL,487975,NULL,7),
	 ('Она не твоя (feat. Стас Пьеха)',NULL,275288,NULL,7);
INSERT INTO main.singles (single_name,description,duration,picture,album_id) VALUES
	 ('Песня императора (Из м/ф "Наша Маша и волшебный орех")',NULL,535484,NULL,7),
	 ('Клоуны',NULL,502762,NULL,8),
	 ('30 минут',NULL,356105,NULL,8),
	 ('Досчитай до ста',NULL,286120,NULL,8),
	 ('Зачем я',NULL,496525,NULL,8),
	 ('Нас не догонят',NULL,462038,NULL,8),
	 ('Я твоя не первая',NULL,328746,NULL,8),
	 ('Робот',NULL,296555,NULL,8),
	 ('Мальчик-гей',NULL,331068,NULL,8),
	 ('Я твой враг',NULL,384978,NULL,8);
INSERT INTO main.singles (single_name,description,duration,picture,album_id) VALUES
	 ('Я сошла с ума',NULL,523315,NULL,8),
	 ('30 минут (Moscow Grooves Institute Remix)',NULL,494549,NULL,8),
	 ('Мальчик-гей (That Black Remix)',NULL,497206,NULL,8),
	 ('Geto Highlites',NULL,389122,NULL,9),
	 ('Gangsta''s Paradise',NULL,380753,NULL,9),
	 ('Too Hot',NULL,343465,NULL,9),
	 ('Cruisin''',NULL,597642,NULL,9),
	 ('Exercise Yo'' Game',NULL,573981,NULL,9),
	 ('Sumpin'' New',NULL,507882,NULL,9),
	 ('Smilin''',NULL,399965,NULL,9);
INSERT INTO main.singles (single_name,description,duration,picture,album_id) VALUES
	 ('Kinda High Kinda Drunk',NULL,281138,NULL,9),
	 ('For My Sistas',NULL,317235,NULL,9),
	 ('Is This Me?',NULL,508683,NULL,9),
	 ('A Thing Goin'' On',NULL,516683,NULL,9),
	 ('Песня',NULL,264067,NULL,10),
	 ('Мне нужен бит',NULL,416338,NULL,10),
	 ('Ну его на (Feat КРП)',NULL,422502,NULL,10),
	 ('Наше лето (Feat Максим)',NULL,326619,NULL,10),
	 ('Чайный пьяница',NULL,478722,NULL,10),
	 ('Skit',NULL,268670,NULL,10);
INSERT INTO main.singles (single_name,description,duration,picture,album_id) VALUES
	 ('Бейби бой',NULL,516607,NULL,10),
	 ('Skit',NULL,438176,NULL,10),
	 ('Война',NULL,323440,NULL,10),
	 ('Чувства',NULL,502967,NULL,10),
	 ('Skit',NULL,443969,NULL,10),
	 ('Пять минут',NULL,512764,NULL,11),
	 ('I''ll Be Home For Christmas',NULL,312473,NULL,11),
	 ('Три Белых Коня',NULL,481044,NULL,11),
	 ('Winter Wonderland',NULL,283851,NULL,11),
	 ('Ёлочка-ёлка',NULL,569701,NULL,11);
INSERT INTO main.singles (single_name,description,duration,picture,album_id) VALUES
	 ('Jingle Bell Rock',NULL,523748,NULL,11),
	 ('А снег идёт',NULL,529638,NULL,11),
	 ('White Christmas',NULL,533420,NULL,11),
	 ('Кабы не было зимы',NULL,511936,NULL,11),
	 ('The Christmas Song',NULL,441112,NULL,11),
	 ('Снежинка',NULL,525892,NULL,11);
	 
INSERT INTO main.collections (collection_name,description,release_year,picture) VALUES
	 ('Лучшие песни шансона','Сборник хороших песен шансона',2021,NULL),
	 ('Лучший РЭП','Сборник любимых песен в стиле РЭП',2020,NULL),
	 ('Сборник №1','Сборник понравившихся песен',2017,NULL),
	 ('Лучшее - Лепс','Сборник лучших песен Григория Лепса',2020,NULL),
	 ('Медляки','Сборник медляков',2018,NULL),
	 ('Любимый джаз',NULL,NULL,NULL),
	 ('Забойный РОК',NULL,2019,NULL),
	 ('Попсятина','Сборник ПОП-музыки',2013,NULL);
	 
INSERT INTO main.collections_singles (collection_id,single_id) VALUES
	 (1,74),
	 (1,75),
	 (1,64),
	 (1,67),
	 (1,70),
	 (1,73),
	 (1,76),
	 (1,79),
	 (2,6),
	 (2,9);
INSERT INTO main.collections_singles (collection_id,single_id) VALUES
	 (2,115),
	 (2,5),
	 (2,2),
	 (2,19),
	 (2,117),
	 (2,119),
	 (3,92),
	 (3,5),
	 (3,56),
	 (3,9);
INSERT INTO main.collections_singles (collection_id,single_id) VALUES
	 (3,100),
	 (3,91),
	 (3,84),
	 (3,73),
	 (3,22),
	 (3,33),
	 (3,23),
	 (3,24),
	 (3,41),
	 (4,93);
INSERT INTO main.collections_singles (collection_id,single_id) VALUES
	 (4,96),
	 (4,97),
	 (4,50),
	 (4,51),
	 (4,49),
	 (4,45),
	 (5,17),
	 (5,50),
	 (5,59),
	 (5,35);
INSERT INTO main.collections_singles (collection_id,single_id) VALUES
	 (5,34),
	 (6,140),
	 (6,146),
	 (6,139),
	 (6,144),
	 (7,9),
	 (7,29),
	 (7,30),
	 (7,31),
	 (7,32);
INSERT INTO main.collections_singles (collection_id,single_id) VALUES
	 (7,33),
	 (8,103),
	 (8,111),
	 (8,106),
	 (8,108);